Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
/*
 * Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

/** @file cy_audio_sw_sbc_decoder.c
 *  Functions to perform SBC encoder operations
 *
 */

#ifdef ENABLE_SBC_DECODE
/*******************************************************************************
 *                      Includes
 ******************************************************************************/
#include <string.h>
#include "cyabs_rtos.h"
#include "cy_audio_sw_sbc_decoder.h"
#include "cy_audio_sw_codec_utils.h"
#include "cy_audio_sw_sbc_decoder_private.h"
#include "cy_audio_sw_sbc_utils.h"
#include "cy_audio_sw_codecs.h"


/*******************************************************************************
 *                      Macros
 ******************************************************************************/

#define SBC_A2DP_SYNC 0x9C
#define SBC_WIDEBAND_SYNC 0xAD
#define SBC_UUID_2_INDEX 0

#define SBC_UUID_2_INDEX_FRAME_LEN 57
/*******************************************************************************
 *                      Enumerations
 ******************************************************************************/

/*******************************************************************************
 *                      Constant
 ******************************************************************************/
const cy_audio_sw_codec_decoder_ops_t cy_audio_sw_decode_sbc = {
    .type = CY_AUDIO_CODEC_TYPE_SBC,
    .init = cy_audio_sw_sbc_decoder_init,
    .decode = cy_audio_sw_sbc_decode,
    .get_recommended_size = cy_audio_sw_sbc_get_decoder_recommended_outbuf_size,
    .decode_stream_info_header = cy_audio_sw_sbc_decode_stream_info_header,
    .deinit = cy_audio_sw_sbc_decoder_deinit
};

static cy_audio_sw_codec_stream_info_t sbc_wide_band_param[SBC_UUID_2_INDEX+1] = {
    {//0
    .sampling_rate = CY_AUDIO_CODEC_SAMPLING_RATE_16000HZ,
    .channel = CY_AUDIO_CODEC_CHANNEL_MONO,
    .bitwidth = CY_AUDIO_CODEC_BITWIDTH_16,
    .codec_specific_info.sbc.allocation_method = SBC_LOUDNESS,
    .codec_specific_info.sbc.bit_pool = 26,
    .codec_specific_info.sbc.channel_mode = 0, //mono
    .codec_specific_info.sbc.sub_bands = 8,
    .codec_specific_info.sbc.sub_blocks = 15,
    .codec_specific_info.sbc.sbc_mode = SBC_MODE_WIDE_BAND,
    .codec_specific_info.sbc.uui_id = 2,
    }
};

/* Currently SBC algo supports only single instance */
static volatile bool g_instance_active = false;

#ifdef ASC_DEC_VERIFY_INPUT_FRAME_MATCH
    static uint32_t FrameCount = 0;
#endif

/*******************************************************************************
 *                      Function decelerations
 ******************************************************************************/
static bool is_valid_stream_info(const cy_audio_sw_codec_stream_info_t *stream_info);
static bool is_valid_sbc_stream_info(const cy_asc_sbc_decode_stream_info_t *sbc_stream_info);
static bool is_valid_sbc_decoder_config(const cy_audio_sw_codec_decode_config_t *codec_config);
static void cy_asc_free_sbc_dec_internal_hdl(sbc_decoder_handle_t* handle);
static cy_rslt_t cy_asc_initialize_algo( sbc_decoder_handle_t handle );
static cy_rslt_t cy_asc_create_sbc_dec_internal_hdl(
                        sbc_decoder_handle_t * a_handle,
                        const cy_audio_sw_codec_decode_config_t *codec_config);
static cy_rslt_t cy_sbc_parse_stream_info_on_decode(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                    uint8_t *in_buff, uint32_t *in_data_len );
static cy_rslt_t cy_asc_handle_decode_header_state (cy_audio_sw_codec_handle_t audio_sw_hdl, uint8_t *in_buff, uint32_t *in_buff_len);
static cy_rslt_t cy_sbc_handle_decode_frame_state(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                  uint8_t *in_buff, uint32_t *in_buff_len,
                                                  uint8_t *out_buff, uint32_t *out_bytes);
static cy_rslt_t cy_asc_parse_a2dp_frame(const uint8_t *pHeader, cy_audio_sw_codec_stream_info_t *stream_info, uint32_t *a_frame_len);
static void cy_sbc_update_and_send_callback_info(
        cy_audio_sw_codec_handle_t audio_sw_hdl, cy_audio_sw_codec_stream_info_t stream_info);
static cy_rslt_t cy_sbc_dec_parse_stream_info_from_header(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                          cy_audio_sw_codec_stream_info_t *stream_info,
                                                          uint8_t *in_buff, uint32_t *in_buff_len, bool is_internal_call);
static cy_rslt_t cy_sbc_dec_get_recommended_outbuf_size_internal(
                    sbc_decoder_handle_t codec_obj,
                    cy_audio_sw_codec_stream_info_t * stream_info,
                    uint32_t *recommended_out_size);

static cy_rslt_t cy_sbc_dec_do_decode(sbc_decoder_handle_t codec_obj, uint8_t *in_buff
                                    , uint8_t *out_buff, uint32_t *out_bytes);
static cy_rslt_t cy_audio_sw_sbc_decode_stream_info_header_internal(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        uint8_t *in_encoded_buff,
        uint32_t *in_encoded_data_len,
        cy_audio_sw_codec_stream_info_t *stream_info,bool is_internal_call);

