Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
/*******************************************************************************
 *                      Function definations
 ******************************************************************************/
static bool is_valid_stream_info(const cy_audio_sw_codec_stream_info_t *stream_info)
{
    bool is_valid_config = false;

    if(stream_info->bitwidth != CY_AUDIO_CODEC_BITWIDTH_16)
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG,"Only 16 bit is supported in SBC algo");
        goto api_exit;
    }

    if( (stream_info->channel != CY_AUDIO_CODEC_CHANNEL_MONO) &&
        (stream_info->channel != CY_AUDIO_CODEC_CHANNEL_STEREO) )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG,"Invalid channel mode:%d", stream_info->channel);
        goto api_exit;
    }

    if( !(stream_info->sampling_rate >= CY_AUDIO_CODEC_SAMPLING_RATE_16000HZ) &&
        (stream_info->sampling_rate <= CY_AUDIO_CODEC_SAMPLING_RATE_48000HZ) )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG,"Invalid sample rate:%d", stream_info->sampling_rate);
        goto api_exit;
    }

    is_valid_config = is_valid_sbc_stream_info(&stream_info->codec_specific_info.sbc);

api_exit:
    return is_valid_config;
}

static bool is_valid_sbc_stream_info(const cy_asc_sbc_decode_stream_info_t *sbc_stream_info)
{
    bool is_valid_config = false;

    if( (sbc_stream_info->sbc_mode != SBC_MODE_A2DP) && (sbc_stream_info->sbc_mode != SBC_MODE_WIDE_BAND) )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC mode:%d",sbc_stream_info->sbc_mode);
        goto api_exit;
    }

    if(sbc_stream_info->sbc_mode == SBC_MODE_WIDE_BAND &&
         sbc_stream_info->uui_id == SBC_WB_SUPPORTED_UUID )
    {
        is_valid_config = true;
    }
    else if(sbc_stream_info->sbc_mode == SBC_MODE_A2DP )
    {
        if( (sbc_stream_info->allocation_method != SBC_LOUDNESS) && (sbc_stream_info->allocation_method != SBC_SNR) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC allocation method:%u",sbc_stream_info->allocation_method);
            goto api_exit;
        }

        if( !(sbc_stream_info->bit_pool >= SBC_DEC_BIT_POOL_MIN) && (sbc_stream_info->bit_pool <= SBC_DEC_BIT_POOL_MAX) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC bit pool:%u", sbc_stream_info->bit_pool);
            goto api_exit;
        }

        if( !(sbc_stream_info->channel_mode >= 0) && (sbc_stream_info->channel_mode <= 3) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC channel mode:%u",sbc_stream_info->channel_mode);
            goto api_exit;
        }

        if( (sbc_stream_info->sub_bands != 4) && (sbc_stream_info->sub_bands != 8) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC sub band:%u",sbc_stream_info->sub_bands);
            goto api_exit;
        }

        if( (sbc_stream_info->sub_blocks != 4) && (sbc_stream_info->sub_blocks != 8) &&\
            (sbc_stream_info->sub_blocks != 12) && (sbc_stream_info->sub_blocks != 16) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC sub block:%u",sbc_stream_info->sub_blocks);
            goto api_exit;
        }

        is_valid_config = true;
    }
    else if(sbc_stream_info->sbc_mode == SBC_MODE_WIDE_BAND &&
            sbc_stream_info->uui_id != SBC_WB_SUPPORTED_UUID )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "unknown UUID:%d with wide band mode, Supported uuid:%d"
                                , sbc_stream_info->uui_id
                                , SBC_WB_SUPPORTED_UUID );
        goto api_exit;
    }
    else
    {
        is_valid_config = false;
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid SBC A2DP stream info");
        goto api_exit;
    }

api_exit:
    return is_valid_config;
}

static bool is_valid_sbc_decoder_config(const cy_audio_sw_codec_decode_config_t *codec_config)
{
    bool is_valid_config = false;

    cy_asc_log_info("Decoder config pram provide Bit:%d, CH:%d, SR:%d sbc mode: %d, uui_id:%d"
                , codec_config->bitwidth
                , codec_config->channel
                , codec_config->sampling_rate
                , codec_config->codec_specific_config.sbc.sbc_mode
                , codec_config->codec_specific_config.sbc.uui_id);

    if( !((codec_config->bitwidth > CY_AUDIO_CODEC_BITWIDTH_INVALID) &&\
        (codec_config->bitwidth < CY_AUDIO_CODEC_BITWIDTH_MAX) &&\
        (codec_config->channel > CY_AUDIO_CODEC_CHANNEL_INVALID) &&\
        (codec_config->channel < CY_AUDIO_CODEC_CHANNEL_MAX ) &&\
        (codec_config->sampling_rate > CY_AUDIO_CODEC_SAMPLING_RATE_INVALID) &&\
        (codec_config->sampling_rate < CY_AUDIO_CODEC_SAMPLING_RATE_MAX) &&\
        (codec_config->codec_specific_config.sbc.sbc_mode >= SBC_MODE_A2DP) &&\
        (codec_config->codec_specific_config.sbc.sbc_mode <=  SBC_MODE_WIDE_BAND) )
          )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "Invalid config pram Bit: %d, CH: %d, SR: %d sbc mode: %d, uui_id:%d"
                                    , codec_config->bitwidth
                                    , codec_config->channel
                                    , codec_config->sampling_rate
                                    , codec_config->codec_specific_config.sbc.sbc_mode
                                    , codec_config->codec_specific_config.sbc.uui_id );
            goto api_exit;
        }

    if(codec_config->codec_specific_config.sbc.sbc_mode == SBC_MODE_WIDE_BAND &&
        codec_config->codec_specific_config.sbc.uui_id != SBC_WB_SUPPORTED_UUID)
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG, "unknown UUID:%d with wide band mode, Supported uuid:%d"
                                , codec_config->codec_specific_config.sbc.uui_id
                                , SBC_WB_SUPPORTED_UUID );
        goto api_exit;
    }

    is_valid_config = true;

api_exit:
    return is_valid_config;
}

static void cy_asc_free_sbc_dec_internal_hdl(sbc_decoder_handle_t* handle)
{
    if( NULL != handle && NULL != *handle)
    {
        if((*handle)->input_buff.buff)
        {
            free((*handle)->input_buff.buff);
        }

        if((*handle)->decoder)
        {
            free((*handle)->decoder);
        }
        free(*handle);
    }
    *handle = NULL;
}


static cy_rslt_t cy_asc_initialize_algo( sbc_decoder_handle_t handle )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    uint16_t status = 0;

    handle->decoder = (SBC_DEC_PARAMS*)calloc(sizeof(SBC_DEC_PARAMS),1);
    if(NULL == handle->decoder)
    {
        result = CY_RSLT_ASC_OUT_OF_MEMORY;
        cy_asc_log_err(result, "out of memory SBC decoder algo hdl-Sz:%u",sizeof(SBC_DEC_PARAMS));
        goto api_exit;
    }

    handle->decoder->sbc_mode = handle->stream_info.codec_specific_info.sbc.sbc_mode;
    handle->decoder->uui_id = handle->stream_info.codec_specific_info.sbc.uui_id;

