Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
    status = SBC_Decoder_decode_Init(handle->decoder);
    if (status != SBC_SUCCESS)
    {
        result = CY_RSLT_ASC_ALGO_INIT_FAILED;
        cy_asc_log_err(result,"SBC algo Init Failed");
        goto api_exit;
    }

    handle->input_buff.buff = (uint8_t *)malloc(handle->frame_len);

    if(NULL == handle->input_buff.buff)
    {
        result = CY_RSLT_ASC_OUT_OF_MEMORY;
        cy_asc_log_err(result, "out of memory Input buffer - Sz:%lu",handle->frame_len);
        goto api_exit;
    }

    handle->input_buff.buff_len = handle->frame_len;
    handle->input_buff.used_len = 0;
    /* Moving to next state */
    handle->decode_state = ASC_SBC_DEC_PARSE_HEADER;

api_exit:
    return result;
}

static cy_rslt_t cy_asc_create_sbc_dec_internal_hdl(
                        sbc_decoder_handle_t * a_handle,
                        const cy_audio_sw_codec_decode_config_t *codec_config)
{
    sbc_decoder_handle_t handle = NULL;
    cy_rslt_t result = CY_RSLT_ASC_GENERIC_ERROR;

    if(NULL != codec_config)
    {
        if( false == is_valid_sbc_decoder_config(codec_config) )
        {
            cy_asc_log_err(CY_RSLT_ASC_BAD_ARG,"Invalid config");
            return CY_RSLT_ASC_BAD_ARG;
        }
    }

    handle = (sbc_decoder_handle_t)malloc(sizeof(sbc_decoder_handle));
    if(NULL != handle)
    {
        memset(handle,0x00,sizeof(sbc_decoder_handle));
        handle->decode_state = ASC_SBC_DEC_STATE_ALGO_NOT_INITIALIZED;

        *a_handle = handle;
        result = CY_RSLT_SUCCESS;
    }

    if(CY_RSLT_SUCCESS != result )
    {
        if(NULL != handle)
        {
            cy_asc_free_sbc_dec_internal_hdl(&handle);
        }
    }

    return result;
}

static cy_rslt_t cy_sbc_parse_stream_info_on_decode(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                    uint8_t *in_buff, uint32_t *in_data_len )
{
    cy_rslt_t result;
    cy_audio_sw_codec_stream_info_t stream_info;

    /* stream is not provided by user or parsed internally, try parsing now */
    result = cy_audio_sw_sbc_decode_stream_info_header_internal(audio_sw_hdl, in_buff,
                                                                in_data_len, &stream_info,true);
    if((CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED == result) || (CY_RSLT_SUCCESS != result) )
    {
        cy_asc_log_err(result,"%s",(CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED == result)?\
                            "Partial header found, feed in more data" :\
                            "Stream info not provided & header is not found, cannot decode data.");
        return result;
    }

    cy_sbc_update_and_send_callback_info(audio_sw_hdl, stream_info);
    return result;
}

static cy_rslt_t cy_asc_handle_decode_header_state (cy_audio_sw_codec_handle_t audio_sw_hdl, uint8_t *in_buff, uint32_t *in_buff_len)
{
    sbc_decoder_handle_t codec_obj     = NULL;
    codec_obj = (sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object;
    uint32_t data_to_copy = 0;
    uint8_t *buff = NULL;
    uint32_t buff_len = 0;
    uint32_t tot_enc_data_len = *in_buff_len;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    //Accumulate buffer to parse header
    buff        = codec_obj->input_buff.buff;
    buff_len    = codec_obj->input_buff.used_len;

    if( codec_obj->input_buff.used_len > 0 &&  codec_obj->input_buff.used_len < SBC_ENC_HEADER_LEN )
    {
        buff        = codec_obj->input_buff.buff;
        buff_len    = codec_obj->input_buff.used_len;
        data_to_copy = GET_DATA_LEN_TO_COPY(SBC_ENC_HEADER_LEN,codec_obj->input_buff.used_len, tot_enc_data_len );
        memcpy( buff+buff_len, in_buff, data_to_copy);
        buff_len += data_to_copy;
        codec_obj->input_buff.used_len += data_to_copy;
    }
    else if ( codec_obj->input_buff.used_len > 0 &&  codec_obj->input_buff.used_len >=  SBC_ENC_HEADER_LEN )
    {
        buff        = codec_obj->input_buff.buff;
        buff_len    = codec_obj->input_buff.used_len;
    }
    else if(tot_enc_data_len >= SBC_ENC_HEADER_LEN)
    {
        buff        = in_buff;
        buff_len    = tot_enc_data_len;
    }
    else if(tot_enc_data_len < SBC_ENC_HEADER_LEN)
    {
        memcpy( codec_obj->input_buff.buff, in_buff, tot_enc_data_len);
        codec_obj->input_buff.used_len = tot_enc_data_len;
        *in_buff_len = tot_enc_data_len;
        return CY_RSLT_SUCCESS;
    }
    else
    {
        result = CY_RSLT_ASC_GENERIC_ERROR;
        cy_asc_log_err(result, "Error!!! Un handled scenario, tot_enc_data_len:%lu Input used:%lu"
                                                , tot_enc_data_len
                                                , codec_obj->input_buff.used_len);
        goto api_exit;
    }

    if(CY_RSLT_SUCCESS == result)
    {
        if( buff[0] != SBC_WIDEBAND_SYNC && buff[0] != SBC_A2DP_SYNC)
        {
            result = CY_RSLT_ASC_HEADER_PARSING_ERROR;
            cy_asc_log_err(result, "Error!!! Expected sync word, not found");
            goto api_exit;
        }

        result = cy_sbc_dec_parse_stream_info_from_header(audio_sw_hdl,&codec_obj->stream_info,buff,&buff_len,true);
        if(CY_RSLT_SUCCESS != result)
        {
            result = CY_RSLT_ASC_HEADER_PARSING_ERROR;
            cy_asc_log_err(result,"Frame header parsing failed");
            goto api_exit;
        }
        *in_buff_len = buff_len;
        /* Add if any data is copied */
        *in_buff_len += data_to_copy;
    }

api_exit:
    if(result == CY_RSLT_SUCCESS)
    {
        codec_obj->decode_state = ASC_SBC_DEC_DECODE_FRAME;
    }

    return result;
}

static cy_rslt_t cy_sbc_dec_do_decode(sbc_decoder_handle_t codec_obj, uint8_t *in_buff
                                    , uint8_t *out_buff, uint32_t *out_bytes)
{
    cy_rslt_t result = CY_RSLT_ASC_GENERIC_ERROR;
    int16_t bytes_decoded = 0;

#ifdef ASC_DEC_VERIFY_INPUT_FRAME_MATCH
    bool is_same = false;
    /* Assumption  - API is called for each frame serially */
    extern bool verify_dec_Inputdata(uint8_t * Data_to_encode, uint32_t Size, uint32_t a_FrameCount);
    is_same = verify_dec_Inputdata(in_buff, codec_obj->frame_len, FrameCount);
    FrameCount++;
    CY_ASSERT (is_same == true);
#endif
    *out_bytes = 0;

