Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
    bytes_decoded = SBC_Decoder_decoder(codec_obj->decoder, in_buff, codec_obj->frame_len, (SINT16*)out_buff);
    if(bytes_decoded <= 0)
    {
        result = CY_RSLT_ASC_ALGO_INTERNAL_ERROR;
        cy_asc_log_err(result,"SBC Decode error!");
    }

    *out_bytes = bytes_decoded * 2; //Samples to bytes
    result = CY_RSLT_SUCCESS;

    return result;
}

static cy_rslt_t cy_sbc_handle_decode_frame_state(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                  uint8_t *in_buff, uint32_t *in_buff_len,
                                                  uint8_t *out_buff, uint32_t *out_bytes)
{
    sbc_decoder_handle_t codec_obj = audio_sw_hdl->audio_sw_algo_object;
    cy_rslt_t result     = CY_RSLT_ASC_GENERIC_ERROR;
    uint32_t rem_len     = 0;
    uint8_t *buff_to_use = NULL;

    *out_bytes = 0;

    if(0 == codec_obj->frame_len)
    {
        cy_asc_log_err(result,"at this stage frame size cannot be unknown");
        *in_buff_len = 0;
        return result;
    }

    if( codec_obj->input_buff.used_len < codec_obj->frame_len )
    {
        rem_len = codec_obj->frame_len - codec_obj->input_buff.used_len;

        if(*in_buff_len < rem_len )
        {
            /* We have less data to decode, cache it and wait for more data */
            rem_len = *in_buff_len;
            memcpy(codec_obj->input_buff.buff+ codec_obj->input_buff.used_len, in_buff, rem_len);
            codec_obj->input_buff.used_len += rem_len;
            result = CY_RSLT_SUCCESS;
            goto api_exit;
        }
        else
        {
            if(codec_obj->input_buff.used_len > 0)
            {
               memcpy(codec_obj->input_buff.buff+ codec_obj->input_buff.used_len, in_buff, rem_len);
               buff_to_use = codec_obj->input_buff.buff;
            }
            else
            {
                buff_to_use = in_buff;
            }

            result = cy_sbc_dec_do_decode(codec_obj,buff_to_use,out_buff,out_bytes);
            if(result == CY_RSLT_SUCCESS)
            {
                *in_buff_len = rem_len;
                codec_obj->input_buff.used_len = 0;
                codec_obj->decode_state = ASC_SBC_DEC_PARSE_HEADER;
            }
        }
    }
    else
    {
        cy_asc_log_err(result,"SBC MW in Bad state, unknown error");
        *in_buff_len = 0;
        goto api_exit;
    }

api_exit:
    return result;
}

static cy_rslt_t cy_asc_parse_a2dp_frame(const uint8_t *pHeader, cy_audio_sw_codec_stream_info_t *stream_info, uint32_t *a_frame_len)
{
    const uint8_t *p_frame, *p_frame1, *p_frame2;
    uint8_t  blocks, channel_mode, sub_bands, bit_pool, channels, join, sampling_freq, allocation_method;
    uint32_t  frame_len, tmp;

    p_frame = pHeader;
    frame_len = 0;

    if (*p_frame != SBC_A2DP_SYNC)
    {
        cy_asc_log_err (CY_RSLT_ASC_HEADER_PARSING_ERROR,"Bad Sync Byte: 0x%02x !!!", *p_frame);
        return CY_RSLT_ASC_HEADER_PARSING_ERROR;
    }

    p_frame1 = p_frame + 1;
    p_frame2 = p_frame1 + 1;

    sampling_freq = (*(unsigned char *)p_frame1 & 0xC0) >> 6;
    blocks = (*(unsigned char *)p_frame1 & 0x30) >> 4;

    switch (blocks)
    {
        case 0x0:blocks = 4; break;
        case 0x1:blocks = 8; break;
        case 0x2:blocks = 12; break;
        case 0x3:blocks = 16; break;
        default: break;
    }
    channel_mode    = (*(unsigned char *)p_frame1 & 0x0C) >> 2;
    channels = (channel_mode == 0) ? 1 : 2;

    allocation_method = (*(unsigned char *)p_frame1 & 0x02) >> 1;
    sub_bands   = (*(unsigned char *)p_frame1 & 0x01);
    sub_bands = (sub_bands == 0) ? 4 : 8;

    bit_pool    = (*(unsigned char *)p_frame2 & 0xff);

    frame_len = 4 + (4 * sub_bands * channels) / 8;

    join = (channel_mode == 3) ? 1 : 0;

    if (channel_mode < 2)
        tmp =  (blocks * channels * bit_pool);
    else
        tmp =  (join * sub_bands + blocks * bit_pool);

    frame_len += tmp / 8 + ((tmp % 8) ? 1 : 0);

    *a_frame_len = frame_len;
    stream_info->codec_specific_info.sbc.allocation_method = allocation_method;
    stream_info->codec_specific_info.sbc.bit_pool = bit_pool;
    stream_info->codec_specific_info.sbc.channel_mode = channel_mode;
    stream_info->codec_specific_info.sbc.sub_bands = sub_bands;
    stream_info->codec_specific_info.sbc.sub_blocks = blocks;

    if(channels == 2)
    {
        stream_info->channel = CY_AUDIO_CODEC_CHANNEL_STEREO;
    }
    else
    {
        stream_info->channel = CY_AUDIO_CODEC_CHANNEL_MONO;
    }

    stream_info->bitwidth = CY_AUDIO_CODEC_BITWIDTH_16;
    stream_info->sampling_rate = cy_asc_sbc_sample_rate_value_to_enum(sampling_freq);
    stream_info->codec_specific_info.sbc.sbc_mode = SBC_MODE_A2DP;

    return CY_RSLT_SUCCESS;
}

static bool is_equal_sbc_stream_info(cy_asc_sbc_decode_stream_info_t * info1, cy_asc_sbc_decode_stream_info_t * info2)
{
    bool value = true;

    if (info1->sub_bands            != info2->sub_bands ||
        info1->sub_blocks           != info2->sub_blocks ||
        info1->allocation_method    != info2->allocation_method ||
        info1->channel_mode         != info2->channel_mode ||
        info1->bit_pool             != info2->bit_pool ||
        info1->sbc_mode             != info2->sbc_mode ||
        info1->uui_id               != info2->uui_id )
    {
        value = false;
    }

    return value;
}

static void cy_sbc_update_and_send_callback_info(
        cy_audio_sw_codec_handle_t audio_sw_hdl, cy_audio_sw_codec_stream_info_t stream_info)
{
    sbc_decoder_handle_t codec_obj = audio_sw_hdl->audio_sw_algo_object;
    cy_rslt_t       result              = CY_RSLT_ASC_INVALID_HANDLE;
    bool            stream_info_changed = false;

    if (codec_obj->stream_info.bitwidth != stream_info.bitwidth ||
        codec_obj->stream_info.channel != stream_info.channel ||
        codec_obj->stream_info.sampling_rate != stream_info.sampling_rate ||
        (false == is_equal_sbc_stream_info(&codec_obj->stream_info.codec_specific_info.sbc,&stream_info.codec_specific_info.sbc)) )
    {
        codec_obj->stream_info         = stream_info;
        codec_obj->stream_info_state   = ASC_SBC_DEC_STRM_INFO_AVAILABLE;
        stream_info_changed                 = true;
        cy_asc_log_info("Stream info change: From{Bit:%d,CH:%d,SR:%d} To{Bit:%d,CH:%d,SR:%d}"
                        ,codec_obj->stream_info.bitwidth, codec_obj->stream_info.channel, codec_obj->stream_info.sampling_rate
                        ,stream_info.bitwidth, stream_info.channel, stream_info.sampling_rate );
    }

    /* Check if the recommended output buffer is detected */
    if(0 == codec_obj->recommended_out_size || true == stream_info_changed)
    {
        result = cy_audio_sw_sbc_get_decoder_recommended_outbuf_size(audio_sw_hdl,
                                                &codec_obj->stream_info,
                                                (uint32_t *)&codec_obj->recommended_out_size);
        if(CY_RSLT_SUCCESS != result)
        {
            cy_asc_log_err(result, "Failed to get recommended out buff sz");
            return;
        }
    }

