Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
    if( (NULL != codec_obj->dec_config.stream_info) && (true == stream_info_changed) )
    {
        codec_obj->dec_config.stream_info((cy_audio_sw_codec_t)audio_sw_hdl,
                        stream_info,codec_obj->dec_config.callback_user_arg);
    }

    return;
}

static cy_rslt_t cy_sbc_dec_parse_stream_info_from_header(cy_audio_sw_codec_handle_t audio_sw_hdl,
                                                          cy_audio_sw_codec_stream_info_t *stream_info,
                                                          uint8_t *in_buff, uint32_t *in_buff_len, bool is_internal_call)
{
    uint32_t loopIdx = 0;
    cy_rslt_t result = CY_RSLT_ASC_INVALID_HANDLE;
    sbc_decoder_handle_t codec_obj = NULL;
    uint32_t buff_len = *in_buff_len;

    if(audio_sw_hdl && audio_sw_hdl->audio_sw_algo_object)
    {
        codec_obj = (sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object;

        while(loopIdx < buff_len )
        {
            if( (in_buff[loopIdx] == SBC_A2DP_SYNC) )
            {
                if(loopIdx + SBC_ENC_HEADER_LEN <= buff_len)
                {
                    result = cy_asc_parse_a2dp_frame((in_buff + loopIdx), stream_info, &codec_obj->frame_len);
                    if(result == CY_RSLT_SUCCESS)
                    {
                        /* Start pos of the header is returned */
                        *in_buff_len = loopIdx;
                    }
                }
                else
                {
                    /* Start pos of the header is returned */
                    *in_buff_len = loopIdx;
                    result = CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED;
                    goto api_exit;
                }
                break;
            }
            else if((in_buff[loopIdx] == SBC_WIDEBAND_SYNC) )
            {
                /* Start pos of the header is returned */
                *in_buff_len = loopIdx;
                if(loopIdx + SBC_ENC_HEADER_LEN <= buff_len)
                {
                    *stream_info = sbc_wide_band_param[SBC_UUID_2_INDEX];
                    codec_obj->frame_len = SBC_UUID_2_INDEX_FRAME_LEN;
                    result = CY_RSLT_SUCCESS;
                }
                else
                {
                    result = CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED;
                    goto api_exit;
                }
                break;
            }

            loopIdx++;
        }

        if(result != CY_RSLT_SUCCESS)
        {
            cy_asc_log_info("No header found in the encoded data");
            result = CY_RSLT_ASC_HEADER_NOT_FOUND;
        }
        else
        {
            if(ASC_SBC_DEC_STRM_INFO_NOT_AVAILABLE == codec_obj->stream_info_state)
            {
                if( false == is_valid_sbc_stream_info(&stream_info->codec_specific_info.sbc) )
                {
                    *in_buff_len = 0;
                    cy_asc_log_err(CY_RSLT_ASC_NOT_SUPPORTED,"unknow/unsupported stream ");
                    return CY_RSLT_ASC_NOT_SUPPORTED;
                }

                if(true == is_internal_call)
                {
                    /* Called from decode api, Check if callback needed to be provided */
                    cy_sbc_update_and_send_callback_info(audio_sw_hdl, *stream_info);
                }

                codec_obj->stream_info         = *stream_info;
                codec_obj->stream_info_state   = ASC_SBC_DEC_STRM_INFO_AVAILABLE;
            }
            else
            {
                cy_sbc_update_and_send_callback_info(audio_sw_hdl, *stream_info);
            }
        }
    }
api_exit:
    return result;
}

cy_rslt_t cy_audio_sw_sbc_decoder_init(
            cy_audio_sw_codec_decode_config_t *codec_config,
            cy_audio_sw_codec_t *handle)
{
    cy_audio_sw_codec_handle_t audio_sw_hdl = NULL;
    sbc_decoder_handle_t codec_obj  = NULL;
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if(true == g_instance_active)
    {
        result  = CY_RSLT_ASC_INVALID_MAX_INSTANCE_REACHED;
        cy_asc_log_err(result, "Already a SBC decoder instance is active");
        return result;
    }

    /* Allocate memory for the handle */
    audio_sw_hdl = (cy_audio_sw_codec_handle_t)malloc(sizeof(cy_audio_sw_codec_handle));
    if(NULL == audio_sw_hdl)
    {
        result = CY_RSLT_ASC_OUT_OF_MEMORY;
        cy_asc_log_err(result, "out of memory sw codec hdl - Sz:%u",sizeof(cy_audio_sw_codec_handle));
        goto error_return;
    }
    memset(audio_sw_hdl,0x00,sizeof(cy_audio_sw_codec_handle));

    /* Initialize API structure and set config params to default */
    result = cy_asc_create_sbc_dec_internal_hdl(&codec_obj, codec_config);
    if(CY_RSLT_SUCCESS != result)
    {
        cy_asc_log_err(result, "Failed to create SBC internal SBC hdl.");
        goto error_return;
    }

    codec_obj->dec_config = *codec_config;
    audio_sw_hdl->audio_sw_algo_object = (void *)codec_obj;
    audio_sw_hdl->pst_audio_sw_codec_ops = (void *)&cy_audio_sw_decode_sbc;
    /* Hardcoded here */
    audio_sw_hdl->header_schema = CY_AUDIO_CODEC_NO_HEADER;
    *handle = audio_sw_hdl;

    cy_asc_log_dbg( "SBC decoder init success Hdl:%p", audio_sw_hdl);

#ifdef ASC_DEC_VERIFY_INPUT_FRAME_MATCH
    FrameCount = 0;
#endif /* ASC_DEC_VERIFY_INPUT_FRAME_MATCH */
    g_instance_active = true;
    return CY_RSLT_SUCCESS;

/* Do a clean return */
error_return:
    if(codec_obj)
    {
        cy_asc_free_sbc_dec_internal_hdl(&codec_obj);
    }

    if(audio_sw_hdl)
    {
        free(audio_sw_hdl);
    }
    *handle = NULL;
    return result;
}

cy_rslt_t cy_audio_sw_sbc_decode(
            cy_audio_sw_codec_handle_t audio_sw_hdl,
            uint8_t *in_encoded_buff,
            uint32_t *in_encoded_data_len,
            uint8_t *out_buff,
            uint32_t *outbuf_len)
{
    sbc_decoder_handle_t codec_obj     = NULL;
    cy_rslt_t                       result              = CY_RSLT_ASC_INVALID_HANDLE;
    uint32_t                        tot_outbuf_len      = *outbuf_len;
    uint32_t                        tot_inbuf_len       = *in_encoded_data_len;
    uint32_t                        in_buff_pos         = 0;
    uint32_t                        out_buff_pos        = 0;

    codec_obj = (sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object;

    if( ASC_SBC_DEC_STRM_INFO_AVAILABLE != codec_obj->stream_info_state )
    {
        result = cy_sbc_parse_stream_info_on_decode(audio_sw_hdl,in_encoded_buff,in_encoded_data_len);
        in_buff_pos = *in_encoded_data_len;
        if(CY_RSLT_SUCCESS != result )
        {
            // cy_asc_log_err(result,"Failed to get stream info"); - Log added in Deeper API
            return result;
        }
    }

    if(*outbuf_len < codec_obj->recommended_out_size)
    {
        cy_asc_log_err(CY_RSLT_ASC_INSUFFICIENT_OUTPUT_BUFF, "Insufficient output buff sz:%lu Recommended:%lu"
                                    ,*outbuf_len, codec_obj->recommended_out_size );
        *in_encoded_data_len  = in_buff_pos;
        *outbuf_len           = 0;
        return CY_RSLT_ASC_INSUFFICIENT_OUTPUT_BUFF;
    }

    result = CY_RSLT_ASC_GENERIC_ERROR;

    while( ( in_buff_pos < tot_inbuf_len)/* &&\
           ((tot_outbuf_len - out_buff_pos) >= codec_obj->config_param.output_size)*/ )
    {
        if(ASC_SBC_DEC_STATE_ALGO_NOT_INITIALIZED == codec_obj->decode_state)
        {
            result = cy_asc_initialize_algo(codec_obj);
            if ( CY_RSLT_SUCCESS != result)
            {
                cy_asc_log_err(result,"error rd next frame");
                break;
            }
        }

        if( ASC_SBC_DEC_PARSE_HEADER == codec_obj->decode_state)
        {
            uint32_t rem_len = tot_inbuf_len - in_buff_pos;
            result = cy_asc_handle_decode_header_state (audio_sw_hdl, (in_encoded_buff+in_buff_pos), &rem_len);
            if ( CY_RSLT_SUCCESS != result)
            {
                cy_asc_log_err(result,"error checking frame header state");
                break;
            }
            in_buff_pos += rem_len;
        }

