Infineon/cce-mtb-psoc6-bt-a2dp-source/source/sw_codec/COMPONENT_SBC_CODEC/abstraction-layer/decoder/src/cy_audio_sw_sbc_decoder.c
        if(ASC_SBC_DEC_DECODE_FRAME == codec_obj->decode_state)
        {
            uint32_t rem_len = (tot_inbuf_len - in_buff_pos);
            uint32_t output_sz = 0;
            /* Check if we have enough outbuff space  */
            if( (tot_outbuf_len - out_buff_pos) < codec_obj->recommended_out_size)
            {
                /* Not enough space to decode a frame to output buff */
                if((codec_obj->input_buff.used_len+rem_len) < codec_obj->frame_len )
                {
                    memcpy(codec_obj->input_buff.buff + codec_obj->input_buff.used_len,
                            in_encoded_buff+in_buff_pos, rem_len);
                    in_buff_pos += rem_len;
                    codec_obj->input_buff.used_len += rem_len;
                }
                else
                {
                    /* More than one frame data to cache, do not cache */
                }
                break;
            }

            result = cy_sbc_handle_decode_frame_state(audio_sw_hdl
                                        , in_encoded_buff+in_buff_pos ,&rem_len
                                        , out_buff+out_buff_pos, &output_sz);
            if(result != CY_RSLT_SUCCESS)
            {
                cy_asc_log_err(result,"Failed at decode frame state");
                break;
            }
            out_buff_pos +=output_sz;
            in_buff_pos +=rem_len;
        }
    }
    *in_encoded_data_len = in_buff_pos;
    *outbuf_len = out_buff_pos;

    cy_asc_log_dbg("Input prvd[in:%lu, out:%lu] Procd[in:%lu, out:%lu] cached:%lu State:%d"
                        , tot_inbuf_len, tot_outbuf_len, in_buff_pos, out_buff_pos
                        , codec_obj->input_buff.used_len
                        , codec_obj->decode_state );
    return result;
}

cy_rslt_t cy_audio_sw_sbc_get_decoder_recommended_outbuf_size(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        cy_audio_sw_codec_stream_info_t * stream_info,
        uint32_t *recommended_out_size)
{
    cy_rslt_t result = CY_RSLT_ASC_INVALID_HANDLE;

    if(audio_sw_hdl && audio_sw_hdl->audio_sw_algo_object)
    {
        result = cy_sbc_dec_get_recommended_outbuf_size_internal(
            (sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object, stream_info, recommended_out_size);
    }
    else
    {
        cy_asc_log_err(result,"Invalid handle obj");
    }

    return result;
}

cy_rslt_t cy_audio_sw_sbc_decode_stream_info_header(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        uint8_t *in_encoded_buff,
        uint32_t *in_encoded_data_len,
        cy_audio_sw_codec_stream_info_t *stream_info)
{
    return cy_audio_sw_sbc_decode_stream_info_header_internal(
            audio_sw_hdl,in_encoded_buff,in_encoded_data_len,stream_info,false);
}

static cy_rslt_t cy_audio_sw_sbc_decode_stream_info_header_internal(
        cy_audio_sw_codec_handle_t audio_sw_hdl,
        uint8_t *in_encoded_buff,
        uint32_t *in_encoded_data_len,
        cy_audio_sw_codec_stream_info_t *stream_info,bool is_internal_call)
{
    sbc_decoder_handle_t codec_obj = NULL;
    cy_rslt_t result = CY_RSLT_ASC_INVALID_HANDLE;
    uint32_t in_buff_len = *in_encoded_data_len;
    uint8_t  *in_buff = NULL;

    if(NULL == stream_info)
    {
        cy_asc_log_err(result,"Invalid stream info");
        return result;
    }

    if(*in_encoded_data_len < SBC_ENC_HEADER_LEN)
    {
         cy_asc_log_err(CY_RSLT_ASC_INSUFFICIENT_INPUT_BUFF,"SBC need min 4B to decode header");
         return CY_RSLT_ASC_INSUFFICIENT_INPUT_BUFF;
    }

    if(audio_sw_hdl && audio_sw_hdl->audio_sw_algo_object)
    {
        codec_obj = (sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object;

        /* Check if any partial header is already backed up */
        if( codec_obj->input_buff.used_len > 0 )
        {
            uint32_t DataToCpy = GET_DATA_LEN_TO_COPY(codec_obj->input_buff.buff_len,codec_obj->input_buff.used_len,*in_encoded_data_len);
            memcpy( codec_obj->input_buff.buff + codec_obj->input_buff.used_len,
                    in_encoded_buff, DataToCpy);
            in_buff     = codec_obj->input_buff.buff;
            in_buff_len = DataToCpy + codec_obj->input_buff.used_len;
        }
        else
        {
            in_buff     = in_encoded_buff;
            in_buff_len = *in_encoded_data_len;
        }

        result = cy_sbc_dec_parse_stream_info_from_header(audio_sw_hdl,stream_info,in_buff,&in_buff_len,is_internal_call);
        if(CY_RSLT_SUCCESS == result)
        {
            if( codec_obj->input_buff.used_len > 0 )
            {
                *in_encoded_data_len = in_buff_len - codec_obj->input_buff.used_len;
                *in_encoded_data_len = 0;
            }
            else
            {
                *in_encoded_data_len = in_buff_len;
            }

            codec_obj->input_buff.used_len = 0;
        }
        else if(CY_RSLT_ASC_PARTIAL_HEADER_IDENTIFIED == result)
        {
            /* Buffer start is identified, but header is incomplete.
             * Until header start all data can be skipped, so skipped length is given as consumed buffers
             */
            *in_encoded_data_len = in_buff_len;
        }
        else
        {
            /* No header found */
            *in_encoded_data_len = 0;
            codec_obj->input_buff.used_len = 0;
        }
    }
    else
    {
        cy_asc_log_err(result,"Invalid handle obj");
    }

    return result;
}

cy_rslt_t cy_audio_sw_sbc_decoder_deinit(
            cy_audio_sw_codec_t *handle)
{
    cy_audio_sw_codec_handle_t  audio_sw_hdl    = NULL;
    cy_rslt_t                   result          = CY_RSLT_ASC_INVALID_HANDLE;

    audio_sw_hdl = (cy_audio_sw_codec_handle_t)(*handle);
    if(audio_sw_hdl)
    {
        cy_asc_log_dbg("SBC decoder deinit Req ASC hdl:%p", *handle)
        if(audio_sw_hdl->audio_sw_algo_object)
        {
            if(((sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object)->decoder)
            {
                SBC_Decoder_decode_DeInit(((sbc_decoder_handle_t)audio_sw_hdl->audio_sw_algo_object)->decoder);
            }
            cy_asc_free_sbc_dec_internal_hdl((sbc_decoder_handle_t*)&audio_sw_hdl->audio_sw_algo_object);
            audio_sw_hdl->audio_sw_algo_object = NULL;
        }
        free(audio_sw_hdl);
        g_instance_active = false;
        result = CY_RSLT_SUCCESS;
        cy_asc_log_dbg("SBC decoder deinit success sw codec");
    }
    else
    {
        cy_asc_log_err(result,"Invalid codec handle obj");
    }

    *handle = NULL;
    return result;
}

static cy_rslt_t cy_sbc_dec_get_recommended_outbuf_size_internal(
                    sbc_decoder_handle_t codec_obj,
                    cy_audio_sw_codec_stream_info_t * stream_info,
                    uint32_t *recommended_out_size)
{
    uint16_t channels       = cy_audio_sw_codec_get_channel_num(stream_info->channel);
    // uint32_t sampling_rate  = cy_audio_sw_codec_get_sampling_rate(stream_info->sampling_rate);
    // uint8_t bitwidth        = cy_audio_sw_codec_get_bitwidth(stream_info->bitwidth);

    cy_asc_log_info("Stream info bit:%d SR:%d CH:%d"
                                            ,stream_info->bitwidth
                                            ,stream_info->sampling_rate
                                            ,stream_info->channel);

    cy_asc_log_info("Decoder SBC specific config pram provide uui_id:%u AM:%u"
                         "bit_pool:%u CH mode:%u sbc mode:%u band:%u blocks:%u"
                , stream_info->codec_specific_info.sbc.uui_id
                , stream_info->codec_specific_info.sbc.allocation_method
                , stream_info->codec_specific_info.sbc.bit_pool
                , stream_info->codec_specific_info.sbc.channel_mode
                , stream_info->codec_specific_info.sbc.sbc_mode
                , stream_info->codec_specific_info.sbc.sub_bands
                , stream_info->codec_specific_info.sbc.sub_blocks );

    if( false == is_valid_stream_info(stream_info) )
    {
        cy_asc_log_err(CY_RSLT_ASC_BAD_ARG,"Invalid stream info passed");
        return CY_RSLT_ASC_BAD_ARG;
    }

    *recommended_out_size   = 2 * (stream_info->codec_specific_info.sbc.sub_blocks* stream_info->codec_specific_info.sbc.sub_bands * channels);
    codec_obj->recommended_out_size = *recommended_out_size;

    return CY_RSLT_SUCCESS;
}


#endif /* ENABLE_SBC_DECODE */